Revit 2026 API

# UIControlledApplicationRegisterContextMenu Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RegisterContextMenu(
	string fullClassName,
	IContextMenuCreator creator
)
```
```vb
Public Sub RegisterContextMenu (
	fullClassName As String,
	creator As IContextMenuCreator
)
```
```cpp
public:
void RegisterContextMenu(
	String^ fullClassName,
	IContextMenuCreator^ creator
)
```
```fsharp
member RegisterContextMenu :
        fullClassName : string *
        creator : IContextMenuCreator -> unit
```

#### Parameters

fullClassName String

creator IContextMenuCreator

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace